app/views/articles/_form.html.erb

SELECT "tags"."id" FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1  [["article_id", 36]]
SELECT "tags".* FROM "tags"
---
<%= form.label :tags, "Select Tags", class: "form-label" %><br>
<%= form.select :tag_ids, options_for_select(Tag.all.collect { |t| [t.name, t.id] }, selected: article.tag_ids), {}, multiple: true, class: "form-control" %>
    <% article.errors.full_messages_for(:tags).each do |message| %>