app/views/articles/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1  [["article_id", 37]]
SELECT 1 AS one FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1 LIMIT $2  [["article_id", 41], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1  [["article_id", 41]]
---
      <h2>Tags:</h2>
      <% if @article.tags.any? %>
        <% @article.tags.each do |tag| %>