app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "status", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "new title"], ["body", "new body of blog"], ["status", "public"], ["created_by", 1], ["created_at", "2024-07-21 13:20:41.589590"], ["updated_at", "2024-07-21 13:20:41.589590"]]
INSERT INTO "articles" ("title", "body", "status", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hello mina "], ["body", "dsffdfdsfdsf"], ["status", "public"], ["created_by", 1], ["created_at", "2024-07-22 08:21:41.663029"], ["updated_at", "2024-07-22 08:21:41.663029"]]
---
    def create
      @article = Article.new(article_params)
      @article.created_by = @current_user.id  # Set the created_by field with the user ID from the token

      if @article.save