app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.new(comment_params)
    @comment.created_by = @current_user.id  # Set the created_by field with the user ID from the token

    if @comment.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "article_id", "status", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "asdasdasd"], ["article_id", 6], ["status", "archived"], ["created_by", 1], ["created_at", "2024-07-21 15:09:06.588971"], ["updated_at", "2024-07-21 15:09:06.588971"]]

  def edit
    @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    if @comment.update(comment_params)
---
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "asdasddaasddssda"], ["updated_at", "2024-07-23 09:05:51.769445"], ["id", 16]]

  def destroy
    puts " Comment destroy"
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]

  def set_comment
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["article_id", 6], ["id", 2], ["LIMIT", 1]]