app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "confirmation_token", "confirmed_at", "confirmation_sent_at", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
      @user = User.new(user_params)
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "minanage@gmail.com"], ["LIMIT", 1]]
---
    def login
      if request.post?
        user = User.find_by(email: params[:email].to_s.downcase)